# 4sq

In [1]:
import getpass

import requests
import json
import pandas as pd

fsq3IBz8M5CTm58GImdCWcCYGDNh5OmA6s8Ue4/YPN7SNe8=

## Token

In [2]:
token = getpass.getpass(prompt='Enter your token: ')

Enter your token: ········

## NEW YORK

In [ ]:
new_york = ["40.748782", "-73.986534"]  # LAT / LON

###### category

In [ ]:
def query_from_frousquare_category (lon, lat, radius, category, limit):

    url = f"https://api.foursquare.com/v3/places/search?ll={lon}%2C{lat}&radius={radius}&categories={category}&sort=DISTANCE&limit={limit}"
    headers = {
        "accept": "application/json",
        "Authorization": token
    }

    response = requests.get(url, headers=headers)
    
    return response

###### query

In [ ]:
def query_from_frousquare (query, lon, lat, radius, limit):
    
    url = f"https://api.foursquare.com/v3/places/search?query={query}&ll={lon}%2C{lat}&radius={radius}&sort=DISTANCE&limit={limit}"

    headers = {
        "accept": "application/json",
        "Authorization": token
    }

    response = requests.get(url, headers=headers)
    
    return response

###### df

In [ ]:
def something_near_somewhere (element):
    
    name = element["name"]
    address = element["location"]["formatted_address"]
    lat = element["geocodes"]["main"]["latitude"]
    lon = element["geocodes"]["main"]["longitude"]
    category_id = element["categories"][0]["id"]
    category = element["categories"][0]["name"]

    dict_ = {"name": name, "address":address, "lat": lat, "lon": lon, "category_id" : category_id, "category": category}
    
    return dict_

### Preschool

In [ ]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 12056, 3)
response = response.json()

In [ ]:
new_lst_1 = []

for i in response["results"]:
    new_lst_1.append(something_near_somewhere(i))

In [ ]:
df1 = pd.DataFrame(new_lst_1)
df1

### Elementary school

In [ ]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000,12057 , 3)
response = response.json()

In [ ]:
new_lst_2 = []

for i in response["results"]:
    new_lst_2.append(something_near_somewhere(i))

In [ ]:
df2 = pd.DataFrame(new_lst_2)
df2

### High school

In [ ]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000,12059 , 3)
response = response.json()

In [ ]:
new_lst_3 = []

for i in response["results"]:
    new_lst_3.append(something_near_somewhere(i))

In [ ]:
df3 = pd.DataFrame(new_lst_3)
df3

### Playground park

In [ ]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000,16037 , 3)
response = response.json()

In [ ]:
new_lst_4 = []

for i in response["results"]:
    new_lst_4.append(something_near_somewhere(i))

In [ ]:
df4 = pd.DataFrame(new_lst_4)
df4

### Airports

In [19]:
response = query_from_frousquare_category (new_york[0], new_york[1], 15000, 19040 , 5)
response = response.json()

In [20]:
new_lst_5 = []

for i in response["results"]:
    new_lst_5.append(something_near_somewhere(i))

In [21]:
df5 = pd.DataFrame(new_lst_5)
df5

,name,address,lat,lon,category_id,category
0,LaGuardia Airport (LGA),"Queens, NY 11371",40.774527,-73.871941,19040,International Airport

### Train stations

In [22]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 19047 , 5)
response = response.json()

In [23]:
new_lst_6 = []

for i in response["results"]:
    new_lst_6.append(something_near_somewhere(i))

In [24]:
df6 = pd.DataFrame(new_lst_6)
df6

,name,address,lat,lon,category_id,category
0,MTA - 34th Street - Herald Square Subway Station,"W 34TH St (at W 34th St), New York, NY 10001",40.749805,-73.988125,19047,Rail Station
1,Penn Station,"393 7th Ave, New York, NY 10001",40.749174,-73.991508,19047,Rail Station
2,LIRR - Lost & Found,"New York, NY 10119",40.749995,-73.991059,19047,Rail Station
3,Calle 34–Estación Penn,"New York, NY 10119",40.750860,-73.991006,19047,Rail Station
4,LIRR Tickets & Information,"Penn Station, New York, NY 10001",40.750743,-73.991351,19047,Rail Station

### Vegan restaurants

In [25]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 13377 , 10)
response = response.json()

In [26]:
new_lst_7 = []

for i in response["results"]:
    new_lst_7.append(something_near_somewhere(i))

In [27]:
df7 = pd.DataFrame(new_lst_7)
df7

,name,address,lat,lon,category_id,category
0,Hangawi,"12 E 32nd St (btwn Madison & 5th Ave), New Yor...",40.746606,-73.984724,13068,American Restaurant
1,PurpleThai,"1204 Broadway, New York, NY 10001",40.746241,-73.988248,13352,Thai Restaurant
2,Sweetgreen,"1384 Broadway (Between 37th St and 38th St), N...",40.752533,-73.987009,13065,Restaurant
3,Beyond Sushi Herald Square,"134 W 37th St, New York, NY 10018",40.752332,-73.988443,13072,Asian Restaurant
4,Sweetgreen,"2 Park Ave (at E 32nd St), New York, NY 10016",40.746341,-73.982530,13065,Restaurant
5,Franchia,"12 Park Ave (at E 34th St.), New York, NY 10016",40.747505,-73.981396,13072,Asian Restaurant
6,Sweetgreen,"1164 Broadway (at W 28th St), New York, NY 10001",40.744773,-73.988670,13065,Restaurant
7,Scen,"1165 Broadway (btwn 27th St & 26th St), New Yo...",40.744816,-73.989065,13377,Vegan and Vegetarian Restaurant
8,Sweetgreen,"7 Pennsylvania Plaza (W. 30th St), New York, N...",40.748877,-73.992500,13065,Restaurant
9,Planta Queen,"15 W 27th St (btwn Broadway & 5th Ave), New Yo...",40.744459,-73.988309,13276,Sushi Restaurant

### Pubs

In [28]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 13018 , 5)
response = response.json()

In [29]:
new_lst_9 = []

for i in response["results"]:
    new_lst_9.append(something_near_somewhere(i))

In [30]:
df9 = pd.DataFrame(new_lst_9)
df9

,name,address,lat,lon,category_id,category
0,O'Reilly's,"21 W 35th St (btwn 5th & 6th Ave.), New York, ...",40.749722,-73.985196,13018,Pub
1,5th & Mad,"7 E 36th St (btwn Madison & 5th Ave), New York...",40.749621,-73.982964,13009,Cocktail Bar
2,The Celtic Rail,"137 W 33rd St (33rd St & 7th Ave), New York, N...",40.750081,-73.989883,13018,Pub
3,Blaggards,"8 W 38th St (btwn 5th & 6th Ave.), New York, N...",40.751169,-73.983593,13018,Pub
4,Crooked Knife,"29 E 30th St (btw Park & Madison), New York, N...",40.745164,-73.984187,13018,Pub

### Night club

In [31]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 10032 , 5)
response = response.json()

In [32]:
new_lst_10 = []

for i in response["results"]:
    new_lst_10.append(something_near_somewhere(i))

In [33]:
df10 = pd.DataFrame(new_lst_10)
df10

,name,address,lat,lon,category_id,category
0,DanceSport Salsa & Bachata Parties NYC,"22 W 34th St, New York, NY 10001",40.748937,-73.986301,10032,Night Club
1,Union League Club,"38 E 37th St (btw Madison Ave & Park Ave), New...",40.748987,-73.980450,10032,Night Club
2,Nebula,"135 W 41st St (btwn 6th Ave & Broadway), New Y...",40.754943,-73.985706,10032,Night Club
3,Mission Nightclub,"229 W 28th St (Between 7th & 8th Ave), New Yor...",40.748059,-73.994827,10032,Night Club
4,Somewhere Nowhere NYC,"112 W 25th St, New York, NY 10001",40.744283,-73.992800,10032,Night Club

### Pet Grooming Service

In [34]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 11134 , 5)
response = response.json()

In [35]:
new_lst_11 = []

for i in response["results"]:
    new_lst_11.append(something_near_somewhere(i))

In [36]:
df11 = pd.DataFrame(new_lst_11)
df11

,name,address,lat,lon,category_id,category
0,Kimomi Pet,"127 Madison Ave, New York, NY 10016",40.745535,-73.984420,11134,Pet Grooming Service
1,All Paws,"120 E 34th St, New York, NY 10016",40.746348,-73.980303,11134,Pet Grooming Service
2,Prime Service NYC,"182 Lexington Ave, New York, NY 10016",40.744707,-73.981112,11134,Pet Grooming Service
3,New York Dog Spa & Hotel,"32 W 25th St (Btw 6th Ave and Broadway), New Y...",40.743422,-73.990714,11134,Pet Grooming Service
4,Urban Dog Spa,"32 W 25th St, New York, NY 10010",40.743367,-73.990755,11134,Pet Grooming Service

### Dog parks

In [37]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 16033 , 5)
response = response.json()

In [38]:
new_lst_12 = []

for i in response["results"]:
    new_lst_12.append(something_near_somewhere(i))

In [39]:
df12 = pd.DataFrame(new_lst_12)
df12

,name,address,lat,lon,category_id,category
0,Green's Garden and Park,"W 32ND St, New York, NY 10001",40.748555,-73.988469,16033,Dog Park
1,Jordan's Dog Run,"New York, NY 10018",40.751100,-73.986123,16033,Dog Park
2,Maliadog VIP Indoor Dog Park,"New York, NY 10001",40.744861,-73.987407,16033,Dog Park
3,Dog Park,"Bryant Park, New York, NY 10001",40.748839,-73.991931,16033,Dog Park
4,Lindsay Ashe Garden,"E 39TH St, New York, NY 10016",40.751390,-73.981374,16033,Dog Park

### Starbucks

In [40]:
response = query_from_frousquare ("starbucks", new_york[0], new_york[1], 2000, 5)
response = response.json()

In [41]:
new_lst_13 = []

for i in response["results"]:
    new_lst_13.append(something_near_somewhere(i))

In [42]:
df13 = pd.DataFrame(new_lst_13)
df13

,name,address,lat,lon,category_id,category
0,Starbucks,"350 5th Ave (W. 33rd St), New York, NY 10118",40.748417,-73.985581,13035,Coffee Shop
1,Starbucks Regional Office,"330 5th Ave (at W 33rd St), New York, NY 10001",40.748153,-73.985353,11130,Office Building
2,Starbucks Reserve,"350 5th Ave (W. 34th St), New York, NY 10118",40.748383,-73.984838,13035,Coffee Shop
3,Starbucks,"373 5th Ave (at E 35th St), New York, NY 10016",40.749103,-73.983801,13035,Coffee Shop
4,Starbucks,"151 W 34th St (at Mezzanine level), New York, ...",40.750749,-73.989123,13035,Coffee Shop

### Basketball

In [43]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 18006 , 5)
response = response.json()

In [44]:
new_lst_14 = []

for i in response["results"]:
    new_lst_14.append(something_near_somewhere(i))

In [45]:
df14 = pd.DataFrame(new_lst_14)
df14

,name,address,lat,lon,category_id,category
0,Basketball Gym At The Dylan,"5TH Ave (32nd St.), New York, NY 10118",40.746752,-73.985298,18008,Basketball Court
1,Jordan Terminal 23,"145 W 32nd St (between 6th & 7th ave), New Yor...",40.749368,-73.990336,18008,Basketball Court
2,Robert Moses Basketball Courts,"42ND St, New York, NY 10017",40.748117,-73.968711,18008,Basketball Court
3,UN Basketball Courts,"42nd Street and the FDR, New York, NY 10017",40.748117,-73.968711,18008,Basketball Court
4,ABC Hoops,"439 W 49th St, New York, NY 10019",40.763603,-73.990721,18008,Basketball Court

### Design

In [46]:
response = query_from_frousquare_category (new_york[0], new_york[1], 2000, 11030 , 5)
response = response.json()

In [47]:
new_lst_15 = []

for i in response["results"]:
    new_lst_15.append(something_near_somewhere(i))

In [48]:
df15 = pd.DataFrame(new_lst_15)
df15

,name,address,lat,lon,category_id,category
0,Interface FLOR Showroom,"330 5th Ave (33rd Street), New York, NY 10001",40.747497,-73.985676,11030,Design Studio
1,Walsh Family Media,"42 W 38th St (Between 5th and 6th Ave), New Yo...",40.751677,-73.984748,11030,Design Studio
2,Style & Co Showroom,"11 Penn Plz (31st Street), New York, NY 10001",40.749124,-73.991375,11030,Design Studio
3,Von Klueger Creative Studio,"1201 Broadway (28th St), New York, NY 10001",40.745628,-73.988966,11030,Design Studio
4,3 Form Show Room,"129 W 29th St, New York, NY 10001",40.747349,-73.991174,11030,Design Studio

# CONCATENATE

In [50]:
df_new_york = pd.concat([df1, 
                              df2, 
                              df3, 
                              df4, 
                              df5, 
                              df6, 
                              df7, 
                              df9, 
                              df10, 
                              df11, 
                              df12, 
                              df13, 
                              df14, 
                              df15])

In [51]:
df_new_york = df_new_york.reset_index(drop=True)

In [52]:
df_new_york

,name,address,lat,lon,category_id,category
0,Chelsea Day School,"319 5th Ave (E 32nd St), New York, NY 10016",40.747135,-73.985094,12056,Preschool
1,Maryel School of New York,"28 E 35th St, New York, NY 10016",40.748030,-73.981941,12056,Preschool
2,ReadingEggs,"37 W 27th St, New York, NY 10001",40.745022,-73.989423,12056,Preschool
3,Libs,"22 W 34th St, New York, NY 10001",40.748882,-73.986342,12057,Primary and Secondary School
4,Alpine County Office of Education,"462 Fashion Ave, New York, NY 10018",40.751852,-73.990259,12057,Primary and Secondary School
...,...,...,...,...,...,...
58,Interface FLOR Showroom,"330 5th Ave (33rd Street), New York, NY 10001",40.747497,-73.985676,11030,Design Studio
59,Walsh Family Media,"42 W 38th St (Between 5th and 6th Ave), New Yo...",40.751677,-73.984748,11030,Design Studio
60,Style & Co Showroom,"11 Penn Plz (31st Street), New York, NY 10001",40.749124,-73.991375,11030,Design Studio
61,Von Klueger Creative Studio,"1201 Broadway (28th St), New York, NY 10001",40.745628,-73.988966,11030,Design Studio
62,3 Form Show Room,"129 W 29th St, New York, NY 10001",40.747349,-73.991174,11030,Design Studio

# SAVE DF

In [53]:
#df_new_york.to_csv("../data/new_york.csv", index=False)